import Link from "next/link";
import React from "react";

const SavingProducts = () => {
  const saving = [
    {
      type: "Royal Saving",
      nepali: "राेयल बचत",
      id: " royal-saving",
    },
    {
      type: "Monthly Regular Saving",
      nepali: "मासिक नियमित बचत",
      id: " monthly-regular-saving",
    },
    {
      type: "Dividend Saving",
      nepali: "लाभांश बचत",
      id: " dividend",
    },
    {
      type: "Women Saving",
      nepali: "नारी बचत",
      id: " women-saving",
    },
    {
      type: "Senior Citizen Saving",
      nepali: "ज्येष्ठ नागरिक बचत",
      id: " senior-citizen-saving",
    },
    {
      type: "Chunumunu Saving",
      nepali: "छुनुमुनु बचत",
      id: " chunumunu-saving",
    },
    {
      type: "Corporate Saving",
      nepali: "संस्थागत बचत",
      id: " corporate-saving",
    },
    {
      type: "Travel Saving",
      nepali: "भ्रमण बचत",
      id: " travel-saving",
    },
    {
      type: "Insurance Saving",
      nepali: "विमा बचत",
      id: " insurance-saving",
    },
    {
      type: "Remittance Saving",
      nepali: "रेमिट्यान्स बचत",
      id: " remittance-saving",
    },
    {
      type: "Recurring Saving",
      nepali: "आवधिक बचत",
      id: " recurring-saving",
    },
    {
      type: "Fixed Saving",
      nepali: "मुद्धती बचत",
      id: " fixed-saving",
    },
  ];

  const products = [
    {
      name: "Royal Saving (राेयल बचत)",
      id: " royal-saving",
      details: [
        "शेयर खरीद पश्चात रु १०० ।– को न्यूनतम मौज्दातमा अनिवार्य रुपमा खाता खोलिने छ ।",
        "भुक्तानी पुर्जाको व्यवस्था हुने ।",
        "दैनिक मौज्दातका आधारमा व्याज प्रदान गरिने ।",
        "त्रैमासिक रुपमा व्याजलाई पुँजिकृत गरिने छ ।",
      ],
    },
    {
      name: "Monthly Regular Saving (मासिक नियमित बचत)",
      id: " monthly-regular-saving",
      details: [
        "संस्थाको शेयर सदस्य बनी सकेपछि यो खाता अनिवार्य सञ्चालन गर्नु पर्नेछ तर संस्थागत शेयर खरिद गर्ने संस्थालाई अनिवार्य हुने छैन ।",
        "मासिक नियमित बचत खाता ३ वर्ष सम्म नियमित नगरेमा सञ्चालक समितिको निणर्यले सदस्यता खारेज हुनेछ ।",
        "समुह ऋण लगानीको लागि सञ्चालित लघु बचत खातालाई मासिक नियमित बचत सरह संचालन भएको मानिने छन् ।",
        "सदस्यले प्रत्येक महिना तोकिएको मासिक बचत रकम रु.१००।- देखी रु.५,०००।- सम्म अनिवार्य बचत गर्नुपर्नेछ ।",
        "तोकिएको रकम भन्दा बढी गर्नुपर्ने भएमा खाता सञ्चालन भएको मितिले ५ वर्ष भित्र र कम गर्नुपर्ने भएमा खाता सञ्चालन भएको मितिले ९ वर्ष भित्र सदस्यको निवेदनको आधारमा व्यवस्थापनले मासिक रकम बढी वा कम गर्न सक्नेछ ।",
        "मासिक निर्धारण गरिएको रकम सदस्य स्वयंको रोयल बचत खाताबाट रकमान्तर गर्न सकिनेछ ।",
        "मासिक बचत जम्मा गरेको १०/१० वर्षमा जम्मा भएको रकमको ९० प्रतिशत बचत फिर्ता दिईनेछ र १० वर्ष पुरा भई भुक्तानी लिई सकेपछि मासिक बचत पुन सञ्चालन भए सरह मानिनेछ ।",
        "सदस्यलाई आवश्यक भएर रकम मागको निवेदन प्राप्त भएमा ५ वर्ष पछि जम्मा भएको रकमको ५० प्रतिशत भुक्तानी दिन बाधा पर्नेछैन ।",
        "संस्थाले शेयर थपको आव्हान गरेमा मासिक बचतको ९० प्रतिशत सम्म शेयरमा रकमान्तर गर्न सकिनेछ ।",
        "आवश्यक भएमा जम्मा भएकोे रकमको ९० प्रतिशत सम्म निक्षेप ऋण पाईनेछ ।",
        "मासिक नियमित बचतको भुक्तानी रोयल बचत खातामा रकमान्तर गरी दिईनेछ ।",
        "लघु बचत खाता अन्तर्गत खोलिएका खाताहरु मासिक नियमित वचत सरह संचालन भएको मानिने छन् ।",
        "दैनिक मौज्दातका आधारमा व्याज प्रदान गरिने ।",
        "त्रैमासिक रुपमा व्याजलाई पुँजिकृत गरिने छ ।",
      ],
    },
    {
      name: "Dividend Saving (लाभांश बचत)",
      id: " dividend",
      details: [
        "शुन्य मौज्दातमा शेयर खरीद पश्चात खाता स्वतः खोलिने छ ।",
        "यस खातामा संस्था बाट प्राप्त शेयर लाभांश, संरक्षित पुँजी फिर्ता कोषको रकम र संस्थाबाट प्रदान गरिने अन्य रकम संस्थाले जम्मा गरीदिनेछ ।",
        "यस बचत खातामा सदस्यले स्वेच्छिक जम्मा गर्न पाउने छैनन् ।",
        "यस खाताको भुक्तानी अन्य बचत खातामा रकमान्तर गरी भुक्तानी दिईनेछ ।",
        "खाताको स्टेटमेन्ट निःशुल्क प्रदान गरिने ।",
        "दैनिक मौज्दातका आधारमा व्याज प्रदान गरिने ।",
        "त्रैमासिक रुपमा व्याजलाई पुँजिकृत गरिने छ ।",
      ],
    },
    {
      name: "Women Saving (नारी बचत)",
      id: " women-saving",
      details: [
        "रु.२,०००।– मा महिला सदस्यहरुले मात्र खाता खोल्न र संचालन गर्न सक्नेछन् ।",
        "पेवाबाट प्राप्त भएको रकम जम्मा गर्न सकिने ।",
        "घर खर्चबाट बचत भएको रकम जम्मा गर्न सकिने ।",
        "दैनिक, साप्ताहिक, मासिक रुपमा जति सुकै रकम जम्मा गर्न सकिने ।",
        "यस खाताको भुक्तानी रोयल बचत खातामा रकमान्तर गरी भुक्तानी दिईनेछ ।",
      ],
    },
    {
      name: "Senior Citizen Saving (ज्येष्ठ नागरिक बचत)",
      id: " senior-citizen-saving",
      details: [
        "६५ वर्ष उमेर पुगेका जेष्ठ सदस्यहरुले रु.१००।– मा खाता खोल्न सकिनेछ ।",
        "स्टेटमेन्ट तथा पासबुक निःशुल्क प्रदान गरीने ।",
        "खातामा जतिसुकै रकम राख्न पाईने ।",
        "यस खाताको भुक्तानी रोयल बचत खातामा रकमान्तर गरी भुक्तानी दिईनेछ ।",
        "सदस्यहरुको माग बमोजिम बचत तथा आर्जित व्याज घरदैलोमै भुक्तानी गरिनेछ ।",
      ],
    },
    {
      name: "Chhunumunu Saving (छुनुमुनु बचत)",
      id: " chunumunu-saving",
      details: [
        "यो बचत खाता नाबालकहरुलाई लक्षित गरी बनाएको हो ।",
        "बालबालिकाको अभिभावक यस संस्थाको सदस्य भएको हुनु पर्नेछ । छुनुमुनु वचत खाता खोल्दा अभिभावकको शेयर प्रमाणपत्रको र बालबालिकाको जन्मदर्ता प्रमाणपत्रको प्रतिलिपी अनिवार्य हुनु पर्नेछ । (अविभावक भन्नाले बुबा, आमा, हजुर बुबा, हजुर आमा, दाजु र दिदी वा स्थानिय तहबाट संरक्षक हो भनि प्रमाणित गरेको व्यक्तिलाई सम्झनु पर्नेछ)",
        "अभिभावकको संरक्षकत्वमा न्युनतम् रकम रु.१००।– देखी जम्मा गर्न सक्नेछन् ।",
        "बालवालिका १६ बर्ष उमेर पुरा भएपछि सदस्यता लिई उक्त खाता बन्द गरी अन्य खातामा रकमान्तर हुनेछ ।",
        "१६ बर्ष भन्दा अगाडी बाल बचत कर्ता विरामी परेमा वा निजको शिक्षाको शुल्क भुक्तानी गर्नु पर्ने भएमा अभिभावकको सहमतिमा रकम निकाल्न पाईनेछ तर यसको लागि तत् सम्बन्धी प्रमाण आवश्यक पर्ने छ ।",
        "छुनुमुनु बचतमा सहभागी सदस्यहरुलाई संस्थाबाट खुत्रुके बाकस उपलब्ध गराईनेछ ।",
      ],
    },
    {
      name: "Corporate Saving (संस्थागत बचत)",
      id: " corporate-saving",
      details: [
        "यो खाता सामाजिक संघ संस्था वा संगठित समूहको सुविधाको लागि हो, जसमा संगठित समूह जस्तै ः स्थानीय बाटो निर्माण समिति, उपभोक्ता समूह, पत्रकार महासंघ, सामुदायिक विद्यालय वा कलेज, हेल्थपोष्ट, आमा समूह, युवा क्लब र सामाजिक संस्था जस्ता गैह« नाफामूलक संस्था आदिले सजिलै संग बचत खाता खोली कारोबार गर्न सक्नेछ ।",
        "रु.१,०००।–मा खाता खोल्न सकिने, दैनिक मौज्दातका आधारमा व्याज प्राप्त हुने ।",
        "भुक्तानी पुर्जाको व्यवस्था हुनेछ ।",
        "संघ संस्थाको अनिबार्य रुपमा सम्बन्धित कार्यालयको दर्ता प्रमाण पत्र रहनु पर्नेछ ।",
      ],
    },
    {
      name: "Travel Saving (भ्रमण बचत)",
      id: " travel-saving",
      details: [
        "यो खाता भ्रमणलाई लक्षित गरि संचालन गरिने ।",
        "भ्रमणमा जान इच्छुक सदस्यहरुले मासिक रुपमा जम्मा गर्नुपर्ने ।",
        "स्वदेश वा विदेश भ्रमणको प्याकेज कार्यक्रममा खर्च गर्न सकिनेछ ।",
        "भ्रमण बचत कार्यक्रममा सहभागी सदस्यहरुलाई संस्था द्वारा लगिने भ्रमण कार्यक्रममा प्राथमिकता दिईनेछ ।",
        "भ्रमण कार्यको लागि मात्र रकम भुक्तानी लिन पाईने छ ।",
        "यस खाताको भुक्तानी रोयल बचत खातामा रकमान्तर गरी भुक्तानी दिईनेछ ।",
      ],
    },
    {
      name: "Insurance Saving (विमा बचत)",
      id: " insurance-saving",
      details: [
        "जीवन वीमा र निर्जिवन वीमा कार्यक्रममा सहभागी हुन नियमित बचत गर्न सकिनेछ ।",
        "खातामा जम्मा भएको रकम त्रैमासिक, अर्धवार्षिक वा वार्षिक रुपमा वीमाको प्रिमियम तिर्नको लागि भुक्तानी गरिनेछ ।",
        "वीमा प्रिमियममा लाग्ने शुल्क बराबरको रकम कबोल बमोजिम जम्मा गर्नुपर्नेछ ।",
        "वीमा सम्वन्धी थप सुविधाहरुमा सहभागी गराईनेछ ।",
        "यस खाताको भुक्तानी रोयल बचत खातामा रकमान्तर गरी भुक्तानी दिईनेछ ।",
      ],
    },
    {
      name: "Remittance Saving (रेमिट्यान्स बचत)",
      id: " remittance-saving",
      details: [
        "स्वदेश वा विदेशबाट प्राप्त रेमिटान्सलाई खाता खोलि राख्न सकिनेछ ।",
        "रेमिटान्सबाट जम्मा भएको रकम अन्य बचत खातामा राख्न वा रु.१००।– को न्युनतम मौज्दातमा रकमान्तर गर्न सकिनेछ ।",
        "रेमिट्यान्सबाट आर्जित रकमलाई जति सक्दो रकमान्तर गरी रोयल बचत खातामा राख्न सकिनेछ ।",
        "यो खाता नँया ग्राहकलाई विशेष फाईदाको लागि लक्षित गरिने ।",
      ],
    },
  ];

  return (
    <div className="max-w-[1400px] flex flex-col lg:flex-row  justify-between gap-4 mx-auto text-black py-4">
      <div className="lg:w-1/4 mx-auto p-6 bg-gray-100 shadow-md lg:sticky lg:top-20 lg:h-screen  w-full ">
        {saving.map((service, index) => (
          <Link
            href={`#${service.id}`}
            key={index}
            className="flex justify-between items-center py-2 border-b border-gray-300"
          >
            <span className="text-gray-500 font-medium line-clamp-1">
              {service.type} ({service.nepali})
            </span>
          </Link>
        ))}
      </div>
      <div className="lg:w-3/4 px-4 w-full  text-black">
        {products.map((product, index) => (
          <div key={product.id} className="mb-8" id={product.id}>
            <h2 className="text-xl font-bold mb-2">{product.name}</h2>
            <ul className="list-disc   pl-5">
              {product.details.map((detail, idx) => (
                <li key={idx} className="mb-1 text-green-500">
                  <p className="text-black">{detail}</p>
                </li>
              ))}
            </ul>
          </div>
        ))}
      </div>
    </div>
  );
};

export default SavingProducts;
